{
  "o1L1Y4nMc20": {
    "id": "o1L1Y4nMc20",
    "title": "Kids & Government Officer",
    "description": [
      "A few weeks back, there was no one at home and I was about to fall asleep. So I switched off the lights and looked out of my room door. I saw a shadow on the wall of the common room. I got up and went out into that room and checked, no one was there. Shadow was also not there.I went back to watching my room and I closed the door and started watching the reels. As I checked the door after sometime, I saw some shadow on the door this time. I switched off the bed light and switched on the regular light and went outside the room and scanned the entire house. Usually I don't believe in ghosts but when you are alone and it's midnight, you believe in everything apart from yourself. I went into the Pooja room. It's a room where we keep God idols not where Pooja lives. Just FYI. I went inside and took one idol each of many Gods we have. and came back into the room. I live in a three bed room flat so It occurred to me that I can goto other rooms as well. But then I thought, let's leave the rooms and sleep in the hall. Now the lights are on in the entire flat. It's almost as if, Modiji announced that we need to switch on all the lights in the night. I thought I will read some book because usually, ghosts are afraid of books. I didn't have religious books so I picked up something which could scared the ghost. I picked up Chetan Bhagat book. As I was reading that's when I realised, there was a mosquito which died on my reading glasses which appeared as a shadow. There was nothing on the wall or the door. It was on my reading glass. I laughed at myself and went back to bed.",
      "But the entire night I couldn't sleep. My brain was so scared, I stayed awake till 6 AM. My brain was not scared of the Ghost, it was scared that I might read Chetan Bhagat book. Engineering, MBA and buying Chetan Bhagat book are the three mistakes of my life. "
    ],
    "publish_date": "2025-07-30T22:30:22-07:00"
  },
  "twn9MmNyuqk": {
    "id": "twn9MmNyuqk",
    "title": "Hand Cricket",
    "description": [
      "Sometimes you know when you are waiting for someone to call so that you can go out and meet them, you do all weird things. One day I was waiting at home all dressed up so that I can go out and meet the person. As I was waiting, I saw reels and I realised I shouldn't waste much time in it. So kept the phone down and started observing the surroundings. Usually, I never see any ants in my house, but I spotted one ant. Curious to know where did it come from, I started noticing it. Infact, I started following it. It was in super hurry and going in a zigzag manner, I just followed. After following it for two rooms and for 20 minutes finally the ant stopped moving. I stopped too. For a few seconds, it did not move and suddenly turned towards me. I got scared. I realised that we were in the last room and because of the wind, the door closed behind. Now I am in a room with an ant and I don't know what intentions it has. The hurriedness in the ant has gone and it took a couple of steps forward. Couple of ant steps. Not human steps. I got scared and turned back, opened the door and looked back it was not there. I slowly walked into my hall sat there and my friend called me to start. As I turned towards that room, I saw two ants now. The other ant stayed for a few seconds and it left. The first ant was still there and it wasn't moving. I thought I was overthinking and I just left the house. In the evening when I came back, I remembered about the ant and searched all the rooms for the ant(s) and I didn't find them. I thought may be an ant couple who lost their way. I slept off and middle of the night I woke up with my foot paining and I got up and switched on the lights and I saw that ant rushing out of my bed room. It bit me!!!!! ",
      "Now I understand, the first ant brought the second ant to confirm if I am the guy..!! The moment the second ant confirmed, it left and the first ant waited for me to get back home. ",
      "hmm. I don't know what I did to the second ant, but if the ant family or any of the ant friends are reading this, I want you to know that I am sorry and please leave me alone. ",
      "I don't know why I am typing all this here, anyway no one reads the description. ",
      "PS: I have a feeling that the description might be more funny than the video. If you feel so, please forgive me and I will do better with my next video. Really sorry and please watch the last 2 and half minutes too. That's my personal favourite :-) "
    ],
    "publish_date": "2025-06-27T22:30:25-07:00"
  },
  "CmYDxOiUMME": {
    "id": "CmYDxOiUMME",
    "title": "Pain | Improv Comedy",
    "description": [
      "So a couple of weeks back, I landed in Hyderabad and the pilot announced that, we landed in Hyderabad and all passengers please be seated. The moment he said that all of us stood up in the aisle. Why should we listen to him bolke. I was anyway sleeping through out the flight and wanted to go home and sleep again, obviously. I was sleeping while standing in the aisle also. That's when I realised, I am a professional sleeper. I can collaborate with other professional sleepers also. Anyway, so I took my bag and started walking out of that aero bridge and one guy came and said, 'excuse me sir', I was ready to give him a selfie and he said, 'I think you are taking my bag and this is your bag and that is mine'. We exchanged the bags and I continued my sleep walking. As I reached the escalator, that guy came again and he said, sorry for the confusion, it is your bag and that is mine. I was like dude, what? and he was like, sorry I was half sleepy and he apologised and gave my bag back. Ya, I wanted to collaborate but not like this re. Now I 80 percent woke up and checked my bag once. I opened it and checked inside also. Everything seemed to be there apart from my jockey underwear. I looked around and that guy was also checking his bag. Both of us looked at each other and smiled awkwardly. I am sure, he must not have stolen jockey of all the things in there. My laptop was there too. But I cannot be 100 percent sure, anything can happen these days. I followed him till the exit. Don't know why though. What was my plan? Push him into the corner and take his pants off? the moment I realised, what I was doing, I politely walked off towards my vehicle. I came home, now completely awake, opened the door and saw the jockey on my sofa. Basically, it was truly, Jockey or nothing moment. ",
      "To that guy, whom I doubted, if you are reading this, I am sorry, I thought you could steal my underwear. Forgive me and I hope you get to buy all kinds of underwears you want to buy in this life. I hope we never meet each other again. ",
      "I don't know why I am writing all this here, nobody reads the description anyway. "
    ],
    "publish_date": "2025-05-29T22:30:13-07:00"
  },
  "3rylkWWGjVA": {
    "id": "3rylkWWGjVA",
    "title": "Confidence | Umpires",
    "description": [
      "I was in the flight to Bengaluru and there was this elderly gentleman who was sitting beside me and mid flight he smiled at me. I also smiled back because, it would be awkward. He said, 'I keep seeing you'.. I said, thanks for seeing me. Then he suddenly asked, if you dont mind me asking, what is your opinion about Donald trump. I said something. Then he asked, what about the tariffs. I said I am only worried about my Airtel tariffs. After not letting me sleep for like 40 minutes and asking all the questions, he asked me one final favour. My daughter is a huge fan of yours. So once we get down, can I do a video call? I said sure. We got down and at the luggage belt, he called his daughter and said, you wont believe whom I met and he brought me into the frame. I said hi. She was like, 'Who is this guy?' all three of us felt awkward and he went to the side and I dont know what they spoke, he comes back and says, 'Sorry there was a confusion. Bye'. I was like dude yeah, bye but who am I re? whom did you think I was ? At least give me name.. Ever since, I have been watching all types of reels to find whom did they think I was. Bakwas fellow. ",
      "I dont know why I am typing all this here, anyway no-one reads descriptions.. "
    ],
    "publish_date": "2025-04-29T22:32:54-07:00"
  },
  "-JDBWT3m6iI": {
    "id": "-JDBWT3m6iI",
    "title": "Unscripted Episode 1| Stand Up Comedy | Gen Z",
    "description": [
      "Hello friends, ",
      "Yesterday as I was sitting at a cafe, a couple was fighting in the next table. Though I wanted to listen to their conversation about what their fight was, I felt that would be a little awkward so I was minding my own business of editing my video. The argument kept escalating and it reached a point where, I think I heard her say, 'You will end up like this guy if I leave you. Alone in a beautiful cafe'. Now I was a little involved in my video editing so and I had ear phones so wasn't sure about what I heard, so I paused the sound. Then I heard the boy say, 'I would end up as a good looking guy at a cafe'. Both of them laughed and argument ended. I was like whaaaat..! I know looks are subjective but overacting is not. So I picked up my phone and started having a fake conversation, loud enough for them to hear. I said, 'Hey man, what's up? I am good thank you. Nothing man, editing a video (Paused for effect) Some couple fighting man. As a psychologist, I could def infer that the guy is cheating in this relationship though. Anyway, I am starting now from my cafe in another 20 minutes'. I hung up the phone, kept my ear phones back, audio was still on mute. But the couple was also on mute for 10 minutes as they had their coffee. They left silently. I was so happy, I pat myself on the back, looked around the cafe and I realised, I was the only guy. I did end up alone in a cafe..!",
      "I dont know why I am typing all this here, nobody reads descriptions anyway. ",
      "This video is from a monthly show called Unscripted where, I mix stand up and one person improv. Watch and enjoy. See you next month :-) "
    ],
    "publish_date": "2025-03-26T22:30:00-07:00"
  },
  "rK8qAUyPIaA": {
    "id": "rK8qAUyPIaA",
    "title": "Wedding Show Gone wrong",
    "description": [
      "The other day I was having sore throat so I went to Apollo to get some tablets. The lady at the counter said, you can use a tablet called Zosef for like three days. I asked her can I have something more Indian, like Siva kumar or Ratnavelu or Amit ? She looked into my eyes with a blank expression for like 3 seconds. If she had maintained the eye contact for another 3 seconds, we would have fallen in love I guess. Then we would have got married in apollo temple. Then we would have named our kids Zosef, Siva and Amit. I would have sang songs with my sore throat to my love of life and if it gets boring it would be bore throat. If I have sound sleep at night it would be snore throat. As I was in this trip of imagination, the lady left and another guy replaced her. 'My name is Amit. How can I help you sir?' I said, 'Amit just give me Zosef'. Another guy came and said, 'Hi sir my name is Joseph, how can I help you?'. 'Dude just stop this already. Give me the tablet for sore throat, zosef'. So Joseph gave Zosef. I took the tablet for two days and did this show. ",
      "My throat might seem sore but hope jokes are not a bore. I will be part of a folklore and I will goto Bangalore. I know its Bengaluru but that doesn't rhyme with lore. Okay bye, I have to goto a grocery store. ",
      "This poem and this video is dedicated to Rathnavelu because he was the only one whom I didn't interact with in the above story. Anyway, I dont know why I am typing all this here, nobody reads descriptions..!!!"
    ],
    "publish_date": "2025-01-30T21:30:19-08:00"
  },
  "aNopmzyzseI": {
    "id": "aNopmzyzseI",
    "title": "Crowd Work & Shopping",
    "description": [
      "Hello friends, ",
      "There is a cover which was lying in one corner of my dining room. Last few days I have been observing. My maid didn't pick up. I tried to push it away into balcony but its still coming back somehow. Its almost as if the wind god is wanting that cover to stay inside my house only. Now because of directors like Rajamouli, I was forced to think is this some person who is reborn as plastic cover. Then I realised, my life is not Rajamouli movie. Mine is more of a Pixar movie, where inanimate objects talk to each other when people are not around. So I put another cover near it so that the first cover wont feel lonely. I went outside and came back and the covers are now entangled with each other. I was like okay fine, at least cover found somebody. The next day maid came back and picked up the second cover. The first cover was still lying there. I felt bad for the early break up and I dint know how this cover will recover. I took that cover to my friends place and left it there. They drink so just in case it want to drink, that room is the better option. Few days later I saw, my friend was taking drinks in that cover. Just wanted to tell you all, loneliness and break ups are tough but please dont drink like this cover. This is my cover story. ",
      "Anyway I dont know why I am typing all this here, nobody reads descriptions anyway. "
    ],
    "publish_date": "2024-12-30T22:00:53-08:00"
  },
  "1ldrSj4suE0": {
    "id": "1ldrSj4suE0",
    "title": "Thoughts and Feelings | Full Show",
    "description": [
      "So hi guys this is a show called thoughts and feelings, I have done this show 38 times this year in various places. Now its on YouTube, please watch share and express your thoughts and feelings. ",
      "Sometimes I wonder even if we express our thoughts and feelings no body listens to them. I am expressing my thoughts and feelings to my robotic vacuum cleaner now. Its nice in a way, because its cleaning floor and I am talking to it. It keeps going away from me. But I think, listening to me drains it I guess because every now then it goes to the charging pod and says, recharging now. Listening is tough man. But its there for me always. Sometimes, I wake up middle of the night I say hi to it, it doesn't say anything. May be its sleeping. But sometimes I hear a response, 'what?' then I realise, my dad stays with me. So whatever I am talking to vacuum cleaner he is listening too. My maid comes to clean utensils, then my dad and maid bitch about the vacuum cleaner. I think I will marry it only now. Eureka is her name. Once married, it will become Eureka Mamidanna or may be I will change to Rajasekhar Forbes."
    ],
    "publish_date": "2024-11-29T01:28:18-08:00"
  },
  "RCTb_XSYONw": {
    "id": "RCTb_XSYONw",
    "title": "Kid Interrupts | Crowd work",
    "description": [
      "You know sometimes people assume that I have kids. Went to a bank to deposit a cheque and that guy there looked at me and said, 'Sir.. there is one new insurance plan for kids, your kids will be proud of you if you take it'. I looked at him blankly and said, 'My kids died in a car accident'. He was visibly shocked and said, 'Sorry to hear that sir. I can connect you to my colleague who sells car insurance sir'. Bakwas fellow.. Sometimes, I feel entire world is trying to sell something to us. Either by force or making us feel guilty. That's why I like Mark Zuckerberg. Without us knowing, through his algorithms, he is selling us stuff which we search for. Sometimes I feel algorithms know more about us than we know ourselves. Socrates said Know thy self. But my friend Subba Rao who works for Microsoft said, 'Algorithms know you better'. I love Microsoft, they never sell their operating systems. We can get pirated versions everywhere. In a world full of Metas, be a Microsoft. When life hits you, dont become hard, become soft. Microsoft. This seems like an ad for Microsoft even though I am typing all this in a MacBook. I will write some line related to Apple also. In a world full of Kindles, be a book. MacBook. When life gives you lemons, sell it and buy Apple. ",
      "I dont know why I am writing all this here, anyway no one reads descriptions. "
    ],
    "publish_date": "2024-10-30T22:30:10-07:00"
  },
  "w60mUjdBFgY": {
    "id": "w60mUjdBFgY",
    "title": "Traffic",
    "description": [
      "Hello friends, this bit called 'Traffic' was recorded in Bengaluru. I did not choose to record in Bengaluru because the traffic is more there, but because recording is cheaper there. I like Bengaluru. Its beautiful. Because traffic is more, vehicles stop, you look around and appreciate the greenery and beauty.  If traffic is not there, you will go fast. So you can't appreciate. In a way, traffic is telling us to slow down, you see.  Anyway watch it. I dont know sometimes I think, entire day I think about jokes, again and again, each day and been doing this from last 10 years. What is the point of all this? Then one incident happened last week. I was walking in a mall and a person came and said he was a huge fan of mine and he took selfie. While leaving he said, 'I really love your motivational videos. You are the best motivation speaker I had met'. May be sometimes, we unintentionally motivate people I guess. May be I will change this channel name to Ted Raja. Or Raja Talks. Or like Jay Shetty, I will be Mami Shetty. or Or like Raja Mamishwari. ",
      "Someday, I want to meet that mall guy again and I want him to come and say, 'Love your motivational videos. watching them I became a stand up comedian'. Then I will goto his shows and tell him, 'You are the best motivational speaker I have seen' . I dont know why I am typing all this here, anyway nobody reads descriptions!"
    ],
    "publish_date": "2024-09-27T22:30:30-07:00"
  },
  "fQL4n2jiYkY": {
    "id": "fQL4n2jiYkY",
    "title": "Self-Talk | Crowd Work",
    "description": [
      "This video was recorded in Bengaluru just after Rakhi. My sister tied a Rakhi and she transferred money to herself from my mobile. My niece tied Rakhi to my nephew and he gifted her a dress which my brother in law brought from the money which my sister transferred to herself from last years Rakhi. That's her concept of mutual funds. ",
      " It would be unfair of me if I say that I got nothing from this festival. I got half a laddoo. The other half was eaten by my nephew. I just realised I bought the laddoos too. I love laddoos. My mom used to make awesome laddoos. I miss them. In fact, I learnt making laddoos from my mom. I made a couple of times. For the benefit of people around me, I decided not to make laddoos any more. I am a sweet fellow but you wont be sweet to me if you eat the sweet I made. Now after writing this, I feel like eating laddoo. I will make myself some. No actually. Weekend shows are there, why to risk health. I will order. "
    ],
    "publish_date": "2024-08-30T22:30:12-07:00"
  },
  "9FWWKE4gw9Q": {
    "id": "9FWWKE4gw9Q",
    "title": "Memories",
    "description": [
      "Hello friends.. First of all its very tough to find a parking spot in malls. Especially during weekends. They will send you to basement after basement and you literally feel as if, your life is just going down in circles. Lets say even if you find a spot and if you forget where you parked, that's it, you have to stay there till next weekend. Some friends will tell you, hey bro, dont worry I will remember where you parked, dont have to take a pic. You trust them and they will forget. But I have a friend, Peter, who is so good at parking. He knows exactly where to park and he remembers the spot like a dream. I always goto malls with this person only. Because he can park well and his name is Peter, we call him Peter Parker. He always used to say, with great parking spot, comes great memory. His girl friend is a jain though. He will Marry jain soon. He used to tell great stories about his uncle, so when I goto his wedding, I will meet his uncle then. I dont know why I am typing all this here, anyway nobody reads descriptions. "
    ],
    "publish_date": "2024-07-30T22:30:05-07:00"
  },
  "9USBzxgaA_U": {
    "id": "9USBzxgaA_U",
    "title": "Birkenstock",
    "description": [
      "Hello.. Hope you are doing fine. I am fine too, thanks for asking. These days I think sometimes even when people ask how am I, I feel if I tell them the truth then they might not be fine, but that's fine because, all of us cannot be fine always but we do pay fine sometimes. ",
      "If a person pays fine always, then as a person he is not a fine person. But if a person never pays fine then we can call him a fine person. Whether a person is fine or not that doesn't define the person. What defines the person is how much caffeine he drinks. If you see, caffeine doesn't rhyme with fine, but that's fine because rhyming doesn't define me. Timing does. Time and rhyme wait for none. Fine and nine wait for nun. I think I will sleep now and wait for sun. ",
      "I really dont know where I am going with this. Because at the end of the day no one reads descriptions. That's fine too. "
    ],
    "publish_date": "2024-06-28T22:30:02-07:00"
  },
  "wvh68sMVxeE": {
    "id": "wvh68sMVxeE",
    "title": "Upma",
    "description": [
      "Hello friends, this show was recorded in Bengaluru. Even though it was hot, I was lucky enough to find water so took bath and did the show. I also had Upma before this show so I was able to passionately talk about it during the show. They were other comedians and they were asking for Upma, I said I can't share. Like Sadhguru once said, 'Never share Upma', I didn't. I did course in Computer science inner engineering. If you listen to my 'word', you can 'excel' and a lot of windows of opportunities will be open. Time to time, you may have to restart the system and stay away from virus but in the end its worth it. I dont know why I am talking like this.. may be because, I wanted to upload this two hours before but the flight from Colombo was delayed and I didn't carry laptop, so I had to wait and talk to Sri Lankan airlines Airhostess to calm myself down. They were sweet enough to tell me that they like Upma, I asked them to come to the show, they said, economy is weak. No money. I said, its okay honey, I will give you a free ticket. Meanwhile a pilot came and said, sir I dont even have money to buy honey. I asked him to become auto pilot instead. Shared autos make more money in Hyderabad and half the times they fly on the roads.  To boost Sri Lankan economy only I am going there often and I stay in Taj Samudra always. Someday I will buy it and rename it to Raj Samudra. I will ask these Airhostess to come and work there. I dont know why I am saying all these. ",
      "Anyway, nobody reads descriptions. I won't say anything here."
    ],
    "publish_date": "2024-04-28T01:01:50-07:00"
  },
  "9c-zI1oEytY": {
    "id": "9c-zI1oEytY",
    "title": "Crowd Work",
    "description": [
      "This video was shot in Mumbai and the audio was mixed by a guy who is in Europe trip with his wife. Someday I also want to go on a Europe trip with my wife but I dont want to work when I am on a holiday. Of course my work is cracking jokes but I won't crack a single joke when I am on a holiday. ",
      "The only trip I am taking these days is guilt trip. There are a few dogs which stay near my apartment. They used to bark at me when I used to come late night. These days they stopped barking. Not because they recognised me, but I think they dont value me enough. But I see them looking at me whenever I come home and I look at them and we realise that both of us are single. But later I found out that they are in general not barking because of an incident. That was a few days back a family with a cute hutch dog went on a Europe trip. Since then, the dogs have become silent. So they used to bark at me and impress that hutch dog it seems. Now that there is nothing to impress they stopped barking. So moral of the story is, the source of audio is in Europe. Both for me and my apartment dogs. ",
      "I dont even know why I am typing all this anyway no one reads descriptions.. "
    ],
    "publish_date": "2024-03-28T22:35:32-07:00"
  },
  "lB09MzKrig8": {
    "id": "lB09MzKrig8",
    "title": "Fights",
    "description": [
      "Hello friends, this video is recorded at Underground Comedy Club which is there in Bengaluru. Dont know why they call it underground because club is in Basement. ",
      "As I was typing this message, I realised there is this mosquito which is flying around me. I looked around and that was the only one. Its making sounds near the ear and landing on my hands but I dont think its biting at all. Last 15 mins I have been observing but its not biting at all. I got my mosquito bat ready to kill but its not biting. Why to kill when its not biting. May be its vegan or May be its giving me love bites. . or may be its that girl whom I rejected in 2nd standard. She died and became a mosquito. But that's unlikely anyway. because that girl would drink my blood if given an opportunity. So much so that, I heard from people that she works at a hospital taking blood out of people. Like Wonder Woman, she is a mosquito woman I am sure. But I am wonder man though, because I always keep wondering what is happening with my life. ",
      "Oh man.. this one is actually biting.. I was not able to figure out from last few minutes.. Now its paining everywhere. Oh come on now, my mosquito bat doesn't have charging. ",
      "I have to do it the old way, kill it with my bare hands. I dont even know why I am writing all this here. Nobody reads descriptions anyway. "
    ],
    "publish_date": "2024-02-28T21:30:10-08:00"
  },
  "FAONamdEVG0": {
    "id": "FAONamdEVG0",
    "title": "Return Gifts",
    "description": [
      "Hello.. this video was recorded in Hyderabad and edited also in Hyderabad because, I am in Hyderabad. But sometimes I feel I should be in Norway. I dont know why though. May be if someone disagrees with me I will tell them, its my way or Norway and I will permanently shift to Norway. Then there is no way, the person who disagreed with me can ever meet me nor can he have his way. Sometimes I wonder just like Norway, is there a place Neither way. Either ways, I would be happy to shift my base. Not only my base, but I would shift all my baes too. What's the point going to a new place and staying alone. I will take my baes too. But I dont have baes. I dont have bae also. If at all, I love somebody and call that person my bae, I would like that person to be from Bengal. So that I can save her number as Bae of Bengal. ",
      "I think, before you unsubscribe to my channel, I will stop this, because its neither going here nor there. But I will go to Norway. Anyway who reads descriptions..!! No way..! "
    ],
    "publish_date": "2024-01-30T21:30:03-08:00"
  },
  "ErZksiShSJg": {
    "id": "ErZksiShSJg",
    "title": "Friends | Full Show",
    "description": [
      "Hello Friends, ",
      "addressing you guys as friends while uploading a video about friends while thinking about friends, I think this is the most friendly I felt in a long time. But you have to understand that when I say hello friends I dont mean that all of you are friends. Its like politicians saying, Bhaayyo aur behano'. We are not related to them. If we were, we wouldn't vote for them. ",
      "When I call you friends, its like Math teacher saying that he won't get angry. Dont pick on me because I said he not she. Because when I think about my Math teacher, it was my teacher. He was an animal. Not like Ranbir Kapoor because he didn't have any Rashmika in her life. ",
      "So I am calling you a friend but dont ask me money. ",
      "I think before I digress completely let me come back to topic. So I was talking about idli. For those of you wondering when, its okay, it doesn't matter. ",
      "A good friend is like Idly. When you are sick, you goto idly. Idly won't judge you because you are a sick person. ",
      "A hot friend is like poori, but once you burst the bubble you will realise  the person is sticky and risky. ",
      "A bad friend is like, Masala Dosa. Might look plain from outside but always carries some masala inside. ",
      "I am like Upma. Some love me, some hate me but if you have me, I am always good for your health. ",
      "I dont know why I keep writing descriptions, nobody reads them anyway. ",
      "This is the last video of this year I have been uploading. I hope you like it. Otherwise also what can I do, I will just upload another video next month. That way I am shameless anyway. ",
      "This video edit and audio edit is done by Yash Raj Barse (Habitat studios). He was able to get the most out of whatever footage I gave him. He recently got married also. I really dont know why I gave you guys that information, may be next time when you meet him, congratulate. But check once if he is still married when you meet him. ",
      "Anyway, I have to have breakfast now. I ordered Vada. Vada is like a friend who wants to go out of India and settle abroad. ",
      "Basically, if Vada is an NRI who will be called Dough nut outside India. Okay bye. Enough now. "
    ],
    "publish_date": "2023-12-28T21:30:04-08:00"
  },
  "SConA8nFzEU": {
    "id": "SConA8nFzEU",
    "title": "I am a Spiritual Person",
    "description": [
      "By the time I planned my Australia trip, India was already on fire and I thought, India will defeat Australia in Finals and I can make fun of Australia in Australia. But life had other plans for Indian team, but I will make fun of Australia in Australia. ",
      "So here I am, uploading this video from Australia, but video was edited by Yash from India because he doesn't have VISA to come to Australia. I am staying at a friends place in Melbourne. Their wifi password is Techsbeauty123. So if you come to Australia, keep typing this password for every connection you can find and may be one will click. If you couldn't, which means they would have changed their password so don't connect to internet and enjoy the beautiful Australia. ",
      "Okay watch the video now, because tomorrow I am watching a movie here. I asked my friends to show me the national animal of Australia and they are taking me to movie Animal. Bakwas fellows\n. ",
      "Venue Courtesy: The Habitat, Mumbai\nShot and Recorded by The Habitat Team at a live standup comedy event at The Big Show All Star Standup Comedy, organised by The Habitat at NCPA, Exprimental Theatre, Mumbai.\nTo know more about such live shows: https://www.instagram.com/indiehabitat",
      "Live Producer: Balraj Singh Ghai\nAssisted by Saurabh Bothra, Tushar Poojari, Chandu Alagu",
      "Directed by: Abhishek Bhutwani",
      "DOP: Abhishek Shrivastav",
      "Video Team:\nVivian Castelino\nMukesh Kumar Yadav",
      "Video Editor - Yash Rajiv Barse\nAudio - Recorded, Mixed and Mastered:\nYash Rajiv Barse"
    ],
    "publish_date": "2023-11-30T03:21:50-08:00"
  },
  "t4UdrCqhjg0": {
    "id": "t4UdrCqhjg0",
    "title": "Crowd Work | Family Trip",
    "description": [
      "I think, sometimes I wonder a lot of things have changed in the last one year, apart from one thing- How much salt is enough while making dal. I asked a lot of people and everybody said some different measurement. When I shared this issue with my friend, she said, everyone will give suggestions but you have to take it with a pinch of salt. Then I put pinch of salt in Dal and somehow it worked. The dal tasted fine. The issue will come when I have to cook for more than one person. Why would I? I am not a cook. I am a stand up comedian. I make dal for myself. I take it with a pinch of salt. If a day arrives where I have to cook for some 100 people, may be I will take it with a bunch of salt. ",
      "Pinch or bunch, I decide, man. I think it applies to everything in life. Not just for Dal. It applies for curries, pickles, sambar etc",
      "The only place it felt awkward was when Gandhi took a bunch of people on Dandi March and took a fist of salt, it actually pinched Britishers. I really don't know what I am typing here. I think, I should stop. Anyway, nobody reads descriptions. ",
      "This Video was recorded in Bengaluru this month with a bunch of great people. If you don't like some jokes, take it with a pinch of salt. "
    ],
    "publish_date": "2023-10-28T22:30:21-07:00"
  },
  "ouwJdh8sXVo": {
    "id": "ouwJdh8sXVo",
    "title": "Hugs are Beautiful",
    "description": [
      "Sometimes I just feel, I am not for this world man. Then I realise, I didn't even see the world. I am just referring to Kondapur, Hyderabad. Here itself I don't know all the people. I know a few people who are part of my world and for them I am not part of their world. Why am I suddenly talking about my ex? Okay, I hope wherever she is, she stays there only. Sometimes I wonder people who hated me in the past see my videos and like me again. Then I realise, even people who will hate me in the future also might be liking my videos right now. So basically if you hate me or like me, I will anyway keep putting videos. I think, I need coffee. But I quit coffee, wait a minute, I had two coffees yesterday. May be I will have one more now and I will quit coffee again. I don't know why I am quitting because quitters don't win and winners don't quit. Thankfully, I am not a winner so I can quit. I think, I will quit writing this description, anyway nobody reads it.. ",
      "This video was shot at this beautiful venue called, Backspace, in Thane. Its run by Waqur and his team, a nice bunch of people. Its one of my favourite bits about hugging. We, as a nation, we don't hug enough. May be if we hug more, some of us will finally start believing that we belong to this world. Okay bye. Take care. Tata"
    ],
    "publish_date": "2023-09-27T22:30:18-07:00"
  },
  "oF_msMs9NqY": {
    "id": "oF_msMs9NqY",
    "title": "Malaysia Experience",
    "description": [
      "So usually, in my profession a lot of people like what we do, but sometimes, some people say something so weird, that it makes you question your existence also. One lady recently came upto me and started the sentence, by saying, 'No offence but'... I have lived enough to know that if a sentence starts with 'No offence' it means offence is going to be there. She said, 'No offence but I think you should stop doing comedy and may be start doing something about your looks'. Its almost as if, she meant, my jokes are affecting my looks. So I told her, 'No offence but I don't look at myself as often as others, so it's their problem'. ",
      "But sometimes some incidents happen in our lives, which make us believe we are on the right track. This incident happened in Malaysia after a show. Probably one of the best moments of my stand up comedy career. I talk about it in this video. ",
      "You see, jokes are subjective, so even if some jokes make only a few people laugh, I am having fun and we will have fun together eventually. You see, having fun together is the best way we can express kindness to each other. ",
      "So basically, according to the lady logic,  even if I become extremely ugly, I will keep cracking jokes :P ",
      "I think instead of writing descriptions I should goto therapy, anyway no one reads descriptions. "
    ],
    "publish_date": "2023-08-29T22:30:09-07:00"
  },
  "_rTE6qLx4jE": {
    "id": "_rTE6qLx4jE",
    "title": "Listening",
    "description": [
      "Hello everybody, ",
      "This Video was shot in Bengaluru, in June. I am uploading it from Kuala Lumpur, Malaysia. I mean, I don't have to say it, but it feels good to say that you know. A comedian who has gone from Kondapur to Kuala Lumpur : D",
      "Just before this show I discovered that my throat is gone completely. My voice sounded like Rani Mukherjee when she gets cold. Raja Mukherjee may be. First thought was will I be able to do the show? Should I cancel? ",
      "I improvised, I did something new. I sang a song also in that bad voice :D We had fun. This was one of the memorable shows I had. I am sorry about my voice to those who are watching the video. ",
      "But I am always grateful to all of you for your support. Also, the best moment of my career happened here at Malaysia show yesterday. Of course will tell about that later :P ",
      "Enjoy the video. Forgive me if my voice spoiled it for you. Next video voice will be better for sure. ",
      "I don't know why I am writing these, who reads descriptions !!"
    ],
    "publish_date": "2023-07-28T22:30:19-07:00"
  },
  "Dwp85SvFLDQ": {
    "id": "Dwp85SvFLDQ",
    "title": "Kids in the audience",
    "description": [
      "Hello Friends, ",
      "This video was shot last month in this place called, Rangbhoomi spaces in Hyderabad. It's a space for artists. We have to pay of course, these days, nobody gives you space for free, even in relationships. It always comes with a cost. In relationships at least there is EMI involved. Emotional Monthly investments.",
      "This show's audience was a mix of NRIs, musicians, broken up singles and kids. The kids are not from broken up singles, even though data says that some couples break up because of kids. These kids belong to a family, who couldn't get rid of them at home while they were leaving for my show. We charged extra for kids because, they deserved it. Usually when I perform with other comedians, we don't allow kids because I don't do adult content(Lack of experience) but other comedians may do adult content. In this show too, even though the kids are present, a comedian performed adult content. Nothing to worry though, these days kids know more adult stuff than some of us adults. I mean, they are here because of adult stuff no. ",
      "Luckily though, I did all great jokes and saved the day and in the end as a bonus, I brought one kid to the stage and played an improv game with the kid. The kids name is Vedanth and this video is dedicated to him. ",
      "I really don't know why I keep writing these descriptions, nobody reads them anyway. "
    ],
    "publish_date": "2023-06-28T22:30:07-07:00"
  },
  "NDHa1DMjs-g": {
    "id": "NDHa1DMjs-g",
    "title": "The Bhutan Experience",
    "description": [
      "Hello friends, this Video was shot in The Habitat Studios, Mumbai, may be a couple of weeks back. I don't remember the date exactly, because usually I don't get dates. ",
      "The sound was mixed by this talented guy named, Yash Barse. He got married recently. That got nothing to do with his ability to mix sound, I just said because I usually mix things like that. Video editing I have done it myself, while having Mangoes. You see its a the season of Mangoes and in my surname I have Mamidi which means mango in Telugu. I keep visiting my brother in laws place once a week and they get mangoes from somewhere and I slowly steal a few mangoes every time. They don't keep track of how many they are getting but I do. They are getting what they deserve :P ",
      "This year planning to get married otherwise I can get married next year also. The idea is to make sure, the person who shoots the video, the person who mixes the sound, the person who edits the videos and the person who performs all should be married. Of course, not to the same person.  ",
      "That would be a marriage of talent and opportunity. Oh, I think that's the tagline of IPL. ",
      "Great, I will stop writing description now, because I am feeling sleepy. I will schedule this video for tomorrow morning and I will sleep now. ",
      "Anyway no one reads the description. "
    ],
    "publish_date": "2023-05-25T22:30:11-07:00"
  },
  "z5ySJCtf8Mk": {
    "id": "z5ySJCtf8Mk",
    "title": "Crowdsourcing the jokes",
    "description": [
      "This video was shot in Mumbai sometime in Feb. I forgot about this footage and was feeling sad that there was no video for me to release this month and in that sadness I went to drink hot chocolate at Aaromale cafe in Hyderabad and realised I last drank Hot chocolate in Feb. Oh man. That's when I remembered that I have this footage so edited it. The sound editing was done by Mumbai guy only because he is the only one I know. ",
      "I mean, I know myself also. When I went to Bhutan this month, I found myself and brought myself back to Hyderabad. Sometimes, when I am alone in my flat I wonder if the guy whom I brought back from Bhutan is also there in the flat. In fact right now, while I am typing this, he was telling me why are you writing essay here nobody reads description. ",
      "Anyway, watch and enjoy this piece of performance from Mumbai show. Hopefully you like it, even if you don't, it's fine, I won't stop performing and I wont stop uploading videos. Even if you like, you wont stop supporting and I wont stop working. So Enjoy.. "
    ],
    "publish_date": "2023-04-27T22:30:23-07:00"
  },
  "b_ld2_urAr0": {
    "id": "b_ld2_urAr0",
    "title": "Going International",
    "description": [
      "\nThis video has stories from my trip to Colombo and Singapore",
      "Special mention to Phani and his friends who told me that we will come Singapore show and nobody showed up. Thank God to other fans, the show went well :P ",
      "This April first week, going to Bhutan. Planning to do a show there. Don't know if people will turn up or may be I will just make the Monks laugh and come back ",
      "April schedule is up on Instagram. You can follow me there @rajamamidanna ",
      "This video is shot at Artkhoj, Bengaluru. Audio edited by Yash Barse of Indie Habitat, in his own Habitat. Video edited by myself in my unnatural habitat, that is my home because my Natural Habitat is stage na. ",
      "I don't know what is the point to this description. Anyway none of you will read it. It's like talking to myself. Okay bye "
    ],
    "publish_date": "2023-03-29T22:30:07-07:00"
  },
  "NFiNbe7dRYI": {
    "id": "NFiNbe7dRYI",
    "title": "Crowd Work & Airbags",
    "description": [
      "Hi. This videos original length was 28 mins. I reduced it to 20 mins because I was too lazy to add Subtitles. This video was shot in Artkhoj, Bengaluru on 18th Feb. The sound was mixed by Yash Barse, from Mumbai on 20th Feb. Video was edited by me in Hyderabad on 22nd Feb. Its being uploaded from Colombo, Srilanka on 24th Feb. You can watch from anywhere :P ",
      "The girl whom I talk to in this video is Manjula and I think she deserves the dedication of this video to her. ",
      "You guys try and come to Live Shows whenever you can :-) "
    ],
    "publish_date": "2023-02-23T21:30:06-08:00"
  },
  "uLVK1y-Mxj4": {
    "id": "uLVK1y-Mxj4",
    "title": "Based on a True Incident",
    "description": [
      "This video is shot at The Habitat, Mumbai. We shot this is in November, I went there in flight. I don't know how audience came to the venue. We had a great time. I came back in flight to Hyderabad. I don't know how audience went to their homes. I can assure you not in flights though. So basically audience went somewhere, I went somewhere but this description is not going anywhere. ",
      "Shot and recorded by The Habitat Team(@TheHabitatStudios ) a live standup comedy event at The Habitat, Mumbai."
    ],
    "publish_date": "2023-01-24T21:30:13-08:00"
  },
  "wppJ9icLFEo": {
    "id": "wppJ9icLFEo",
    "title": "Love and Peace | Full Show",
    "description": [
      "A few months back, when I announced this show, a lot of friends, seeing the title asked me, 'how can love and peace coexist? It's not possible'. ",
      "I met a lot of people as a preparation to this show. I spoke to a few trauma survivors, psychiatrists, counsellors and listening to them speak I realised that we have set the bar too low.",
      "I have decided once for all that, love and peace can coexist and my entire life will be on this basic premise that: Any love which doesn't evoke peace, may not be love. ",
      "Hope, we all strive for a love which brings peace to us and to our loved ones. Hope you enjoy the show :-) "
    ],
    "publish_date": "2022-12-26T21:30:17-08:00"
  },
  "kFnsS3LVgXo": {
    "id": "kFnsS3LVgXo",
    "title": "Heroes and Artists",
    "description": [
      "Video is shot at ArtKhoj, Bengaluru. Not on shot on iPhone because we were able to afford professional camera guys. We were able to afford because we were able save some money from the previous few shows. We were able to save because we have savings account in a bank. If we had current account we wouldn't have been able to save and it would have been shocking. So if you have money always have savings account. Or you can have cravings account. Don't know where we are going with this description. Ignore this and watch the video. ",
      "You can watch my special about my mom, 'A Love letter to mom' here: ",
      "https://www.youtube.com/watch?v=yz2bZgPSyH0&t=529s"
    ],
    "publish_date": "2022-12-08T21:30:06-08:00"
  },
  "Ldw5XLktwrA": {
    "id": "Ldw5XLktwrA",
    "title": "Crowd Work | Google Girl",
    "description": [
      "Video edited by me. Subtitles by Megha Shyam. One by two is half. Its a good habit to flush the toilet after you are done. The coffee in McDonalds is average. Upma is love. To make it you need stove. My nephew uses Dove. The dog Barks bow bow. I dont even know why I am writing this description. You guys take care of yourself and your loved ones. "
    ],
    "publish_date": "2022-11-23T21:30:02-08:00"
  }
}